Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: On a Windows platform you can associate php.exe with the double click option of the .php files, or you can make a batch file to run the script through PHP.
pt_br: Na plataforma Windows, você pode associar php.exe -q com o clique duplo em arquivos .php ou fazer um arquivo batch para rodar seus scripts através do PHP.

source: The first line added to the script to work on Unix won 't hurt on Windows, so you can write cross platform programs this way.
pt_br: A primeira linha acrescentada ao script nos Unix não funcionam no Windows, por isso você não pode escrever programas independentes de plataforma desse jeito.

source: A simple example of writing a command line PHP program can be found below.
pt_br: Um exemplo simples de como escrever um programa para a linha de comando segue abaixo:

source: Example 23-1.
pt_br: Exemplo 23-1.

source: Script intended to be run from command line (script.php)
pt_br: Um script para rodar na linha de comando (script.php)

source: This is a command line PHP script with one option.
pt_br: Este é um script de linha de comando com um parâmetro.

source: Usage: ?php echo $argv[ 0];? option option can be some word you would like to print out.
pt_br: Uso: ?php echo $argv[ 0];? opcao opcao pode ser qualquer palavra que você queira imprimir.

source: With the --help, -help, -h, or -? options, you can get this help. ?php} else {echo $argv[1];}?
pt_br: Com as opções --help, -help, -h ou -?, você pode obter essa ajuda. ?php} else {echo $argv[1];}?

source: In the script above, we used the special first line to indicate that this file should be run by PHP.
pt_br: No script acima, nós utilizamos uma primeira linha especial para indicar que este arquivo precisa rodar pelo PHP.

source: We work with a CLI version here, so there will be no HTTP header printouts.
pt_br: Como nós trabalhamos com a versão CLI aqui, não serão impressos headers HTTP.

source: There are two variables you can use while writing command line applications with PHP: $argc and $argv.
pt_br: Há duas variáveis que você precisa conhecer para escrever aplicações em linha de comando com o PHP: $argc e $argv.

source: The first is the number of arguments plus one (the name of the script running).
pt_br: O primeiro é o número de argumentos mais um (o nome do script executando).

source: The second is an array containing the arguments, starting with the script name as number zero ($argv[0]).
pt_br: O segundo é um array contendo os argumentos, começando com o nome do script no índice zero ($argv[0]).

source: In the program above we checked if there are less or more than one arguments.
pt_br: No programa acima é verificado se há apenas um argumento fornecido.

source: Also if the argument was --help, -help, -h or -?, we printed out the help message, printing the script name dynamically.
pt_br: Se o argumento for --help, -help, -h ou -?, é impresso uma mensagem de ajuda, imprimindo o nome do script dinamicamente.

source: If we received some other argument we echoed that out.
pt_br: Qualquer outro argumento é exibido como informado.

source: If you would like to run the above script on Unix, you need to make it executable, and simply call it as script.php echothis or script.php -h.
pt_br: Para rodar esse aplicativo nos Unix, basta torná-lo executável e o chamar diretamente como script.php exibaisso ou script.php -h.

source: On Windows, you can make a batch file for this task:
pt_br: No Windows, você pode fazer um arquivo batch para esta tarefa:

source: Example 23-2.
pt_br: Exemplo 23-2.

source: Batch file to run a command line PHP script (script.bat)
pt_br: Arquivo batch para rodar um script em linha de comando (script.bat)

source: @c:\php\cli\php.exe script.php %1 %2 %3 %4
pt_br: @c:\php\php.exe script.php %1 %2 %3 %4

source: Assuming you named the above program script.php, and you have your CLI php.exe in c:\php\cli\php.exe this batch file will run it for you with your added options: script.bat echothis or script.bat -h.
pt_br: Assumindo que você nomeou o programa acima como script.php, e você tem um php.exe em c:\php\php.exe este arquivo batch irá rodar com os seguintes parâmetros: script.bat exibaisso ou script.bat -h.

source: See also the Readline extension documentation for more functions you can use to enhance your command line applications in PHP.
pt_br: Veja também a documentação da extensão Readline para mais funções que você pode usar para incrementar suas aplicações para linha de comando em PHP.

source: Function Reference
pt_br: Referência das Funções

source: PHP Manual
pt_br: Anterior

source: PHP transparently supports HTTP cookies.
pt_br: O PHP suporta transparentemente cookies HTTP.

source: Cookies are a mechanism for storing data in the remote browser and thus tracking or identifying return users.
pt_br: Cookies são um mecanismo para guardar dados no navegador remoto possibilitando o acompanhamento ou identificação de usuários que retornam.

source: You can set cookies using the setcookie() function.
pt_br: Você pode criar cookies usando a função setcookie().

source: Cookies are part of the HTTP header, so setcookie() must be called before any output is sent to the browser.
pt_br: Os cookies são uma parte do cabeçalho HTTP, logo setcookie() precisa ser chamada antes que qualquer outro dado seja enviado ao navegador.

source: This is the same limitation that header() has.
pt_br: Esta é a mesma limitação que a função header() tem.

source: You can use the output buffering functions to delay the script output until you have decided whether or not to set any cookies or send any headers.
pt_br: Você pode usar as funções de output buferizado para atrasar as impressões do script até que você tenha decidido ou não configurar qualquer cookie ou enviar mais headers.

source: Any cookies sent to you from the client will automatically be turned into a PHP variable just like GET and POST method data, depending on the register_globals and variables_order configuration variables.
pt_br: Qualquer cookie enviado por você para o cliente automaticamente será uma variável do PHP assim como dados de postagens GET ou POST, dependendo dos valores de register_globals e variables_order.

source: If you wish to assign multiple values to a single cookie, just add [] to the cookie name.
pt_br: Se você deseja assimilar vários valores em um único cookie, simplesmente acrescente [] ao nome do cookie.

source: In PHP 4.1.0 and later, the $_COOKIE auto-global array will always be set with any cookies sent from the client. $HTTP_COOKIE_VARS is also set in earlier versions of PHP when the track_vars configuration variable is set.
pt_br: NO PHP 4.1.0 e posteriores, o array superglobal $_COOKIE sempre estará preenchido com quaisquer cookies enviados do cliente. $HTTP_COOKIE_VARS, existente nas versões anteriores do PHP, também, quando a variável de configuração track_vars estiver ativa.

source: For more details, including notes on browser bugs, see the setcookie() function.
pt_br: Para mais detalhes, incluindo comentários sobre problemas de browsers, veja a função setcookie().

source: Handling file uploads
pt_br: Gerenciar o upload de arquivos

source: Chapter 18.
pt_br: Capítulo 18.

source: The MAX_FILE_SIZE item cannot specify a file size greater than the file size that has been set in the upload_max_filesize ini-setting.
pt_br: O item MAX_FILE_SIZE não pode especificar um tamanho de arquivo com tamanho maior do que o especificado no php.ini em upload_max_filesize.

source: The default is 2 Megabytes.
pt_br: O padrão é 2 Megabytes.

source: Make sure to set memory_limit large enough.
pt_br: Se o limite de memória esta ativado, um maior memory_limit pode ser necessário. tenha certeza de estabelecer um memory_limit grande o suficiente.

source: If max_execution_time is set too small, script execution may be exceeded the value.
pt_br: Se max_execution_time for muito pequeno, a execução do script pode ultrapassar o limite de tempo.

source: Make sure to set max_execution_time large enough.
pt_br: Tenha certeza de estabelecer um max_execution_time grande o suficiente.

source: If post_max_size set too small, large files cannot be uploaded.
pt_br: Se post_max_size for muito pequeno, arquivos grandes não poderão ser carregados.

source: Make sure to set post_max_size large enough.
pt_br: Tenha certeza de estabelecer post_max_size grande o suficiente.

source: Not validating which file you operate on may mean that users can access sensitive information in other directories.
pt_br: Não validar o arquivo que você esta operando pode permitir que os usuários acessem informações sensíveis em outros diretórios.

source: Please note that the CERN httpd seems to strip off everything starting at the first whitespace in the content-type mime header it gets from the client.
pt_br: Por favor note que o CERN httpd aparenta cortar tudo iniciando após o primeiro espaço do header content-type que ele recebe do cliente.

source: As long as this is the case, CERN httpd will not support the file upload feature.
pt_br: Se for este o caso, CERN httpd não irá suportar o upload de arquivos.

source: Due to the large amount of directory listing styles we cannot guarantee that files with exotic names (like containing spaces) are handled properly.
pt_br: Devido ao grande número de estilos de listagem de diretórios nós não podemos garantir que arquivos com nomes exóticos( como que contém espaço) sejam manuseados corretamente.

source: Error Messages Explained
pt_br: Explicação das mensagens de erro

source: Uploading multiple files
pt_br: Carregando múltiplos arquivos

source: Since PHP 4.2.0, PHP returns an appropriate error code along with the file array.
pt_br: Desde o PHP 4.2.0, PHP retorna um código de erro apropriado na array do arquivo.

source: The error code can be found in the ['error'] segment of the file array that is created during the file upload by PHP.
pt_br: O código de erro pode ser encontrado em ['error'] na array que é criada durante o upload do arquivo.

source: In otherwords, the error might be found in $_FILES[ 'userfile']['error'].
pt_br: Em outras palavras, o erro deve ser encontrado em $_FILES[ 'userfile']['error'].

source: Value:
pt_br: Valor:

source: 0; There is no error, the file uploaded with success.
pt_br: 0; não houve erro, o upload foi bem sucedido.

source: 1; The uploaded file exceeds the upload_max_filesize directive in php.ini.
pt_br: Valor 1; O arquivo no upload é maior do que o limite definido em upload_max_filesize no php.ini.

source: 2; The uploaded file exceeds the MAX_FILE_SIZE directive that was specified in the html form.
pt_br: 2; O arquivo ultrapassa o limite de tamanho em MAX_FILE_SIZE que foi especificado no formulário html.

source: 3; The uploaded file was only partially uploaded.
pt_br: 3; o upload do arquivo foi feito parcialmente.

source: 4; No file was uploaded.
pt_br: 4; Não foi feito o upload do arquivo.

source: These became PHP constants in PHP 4.3.0
pt_br: Estas tornaram-se constantes no PHP 4.3.0

source: Common Pitfalls
pt_br: Problemas comuns

source: PHP is capable of receiving file uploads from any RFC-1867 compliant browser (which includes Netscape Navigator 3 or later, Microsoft Internet Explorer 3 with a patch from Microsoft, or later without a patch).
pt_br: Gerenciar o upload de arquivos

source: This feature lets people upload both text and binary files.
pt_br: Upload de arquivos com o método POST

source: With PHP 's authentication and file manipulation functions, you have full control over who is allowed to upload and what is to be done with the file once it has been uploaded.
pt_br: O PHP é capaz de receber o upload de qualquer browser que siga a norma RFC-1867 (o que inclui Netscape Navigator 3 ou posterior, Microsoft Internet Explorer 3 com um patch da Microsoft, ou posterior sem patch).

source: Related Configurations Note:
pt_br: Isto permite que se faça o upload de arquivos de texto e binários.

source: See also the file_uploads, upload_max_filesize, upload_tmp_dir, and post_max_size directives in php.ini
pt_br: Com as funções de autenticação e manipulação de arquivos do PHP, você tem o controle completo de quem pode fazer o upload de arquivo e o que fazer com o arquivo após seu upload.

source: Note that PHP also supports PUT-method file uploads as used by Netscape Composer and W3C 's Amaya clients.
pt_br: Veja também file_uploads, upload_max_filesize, upload_tmp_dir, e post_max_size no php.ini

source: See the PUT Method Support for more details.
pt_br: Note que o PHP também suporta o método PUT para upload de arquivos como o usado por Netscape Composer e W3C 's Amaya clients.

source: A file upload screen can be built by creating a special form which looks something like this:
pt_br: Uma tela para upload de arquivo pode ser criada com um formulário especial parecido com este:

source: Example 18-1.
pt_br: Exemplo 18-1.

source: File Upload Form
pt_br: Formulário para Upload de Arquivo

source: form enctype=" multipart / form-data "action="_URL_" method="post "input type="hidden" name="MAX_FILE_SIZE "value="30000" Send this file: input name="userfile "type="file" input type="submit "value="Send File" / form
pt_br: form enctype=" multipart / form-data "action="_URL_" method="post "input type="hidden" name="MAX_FILE_SIZE "value="30000" Send this file: input name="userfile "type="file" input type="submit "value="Enviar Arquivo" / form

source: The MAX_FILE_SIZE is advisory to the browser.
pt_br: O valor de MAX_FILE_SIZE é um aviso para o browser.

source: It is easy to circumvent this maximum.
pt_br: É fácil contornar este limite.

source: So don 't count on it that the browser obeys your wish!
pt_br: Então não conte que o browser irá obedecer a sua vontade.

source: The PHP-settings for maximum-size, however, cannot be fooled.
pt_br: O que foi estabelecido para maximum-size no PHP não pode ser enganado.

source: The Variables defined for uploaded files differs depending on the PHP version and configuration.
pt_br: As variáveis definidas para o upload de arquivos são diferentes dependendo da versão e da configuração.

source: The autoglobal $_FILES exists as of PHP 4.1.0 The $HTTP_POST_FILES array has existed since PHP 4.0.0.
pt_br: A array $HTTP_POST_FILES existe desde o PHP 4.0.0.

source: These arrays will contain all your uploaded file information.
pt_br: Estas array irão conter toda a informação do upload do arquivo.

source: Using $_FILES is preferred.
pt_br: Usar $_FILES é preferido.

source: If the PHP directive register_globals is on, related variable names will also exist. register_globals defaults to off as of PHP 4.2.0.
pt_br: O padrão de register_globals é off desde o PHP 4.2.0.

source: The contents of $_FILES from our example script is as follows.
pt_br: Os conteúdos de $_FILES do nosso script de exemplo é como segue.

source: Note that this assumes the use of the file upload name userfile, as used in the example script above.
pt_br: Note que isso assume que o nome do upload do arquivo é userfile, como o usado no exemplo acima.

source: The original name of the file on the client machine.
pt_br: O nome original do arquivo no computador do usuário.

source: The mime type of the file, if the browser provided this information.
pt_br: O tipo mime do arquivo, se o browser deu esta informação.

source: An example would be "image / gif".
pt_br: Um exemplo pode ser "image / gif".

source: The size, in bytes, of the uploaded file.
pt_br: O tamanho, em bytes, do arquivo.

source: The temporary filename of the file in which the uploaded file was stored on the server.
pt_br: O nome temporário do arquivo, como foi guardado no servidor.

source: The error code associated with this file upload. ['error'] was added in PHP 4.2.0
pt_br: O código de erro associado a este upload de arquivo. ['error'] foi adicionado no PHP 4.2.0

source: In PHP versions prior 4.1.0 this was named $HTTP_POST_FILES and it 's not an autoglobal variable like $_FILES is.
pt_br: Em versões anteriores a 4.1.0 o nome era $HTTP_POST_FILES e não é uma variável autoglobal como $_FILES é.

source: PHP 3 does not support $HTTP_POST_FILES.
pt_br: PHP 3 não suporta $HTTP_POST_FILES.

source: When register_globals is turned on in php.ini, additional variables are available.
pt_br: Quando register_globals esta em on no php.ini, variáveis adicionais estão disponíveis.

source: For example, $userfile_name will equal $_FILES[ 'userfile']['name'], $userfile_type will equal $_FILES['userfile']['type'], etc.
pt_br: Por exemplo, $userfile_name será igual a $_FILES[ 'userfile']['name'], $userfile_type será igual a $_FILES['userfile']['type'], etc.

source: Keep in mind that as of PHP 4.2.0, register_globals defaults to off.
pt_br: Lembre-se que desde o PHP 4.2.0, o padrão para register_globals é off.

source: It 's preferred to not rely on this directive.
pt_br: É preferrível não depender desta opção.

source: Files will by default be stored in the server 's default temporary directory, unless another location has been given with the upload_tmp_dir directive in php.ini.
pt_br: Os arquivos serão guardados no diretório temporário do servidor, a menos que outro lugar seja especificado com a opção upload_tmp_dir no php.ini.

source: The server 's default directory can be changed by setting the environment variable TMPDIR in the environment in which PHP runs.
pt_br: Mudando-a com putenv() de um script PHP não irá funcionar.

source: Setting it using putenv() from within a PHP script will not work.
pt_br: Esta variável de ambiente também pode ser usada para se ter certeza que outras operações estão funcionando no arquivo do upload.

source: This environment variable can also be used to make sure that other operations are working on uploaded files, as well.
pt_br: Note que deve se definir upload_temp_dir no php.ini ou TMPDIR, não podendo estarem ambos vazios, sendo recomendado no mínimo upload_tmp_dir.

source: Example 18-2.
pt_br: Exemplo 18-2.

source: Validating file uploads
pt_br: Validando o upload de arquivos

source: See also the function entries for is_uploaded_file() and move_uploaded_file() for further information.
pt_br: Veja também as funções is_uploaded_file() e move_uploaded_file() para maiores informações.

source: The following example will process the file upload that came from a form.
pt_br: O seguinte exemplo irá processar o envio de um arquivo que vem de um formulário.

source: ?php / / In PHP earlier then 4.1.0, $HTTP_POST_FILES should be used instead of $_FILES. / / In PHP earlier then 4.0.3, use copy() and is_uploaded_file() instead of move_uploaded_file $uploaddir = '/ var / www / uploads /'; print "pre"; if (move_uploaded_file($_FILES['userfile']['tmp_name'], $uploaddir. $_FILES['userfile']['name'])) {print "File is valid, and was successfully uploaded.
pt_br: ?php / / Nas versões anteriores a 4.1.0, $HTTP_POST_FILES deve ser usado ao invés de $_FILES. / / Nas versões anteriores a 4.0.3, use copy() e is_uploaded_file() ao invés move_uploaded_file $uploaddir = '/ var / www / uploads /'; print "pre"; if (move_uploaded_file($_FILES['userfile']['tmp_name'], $uploaddir. $_FILES['userfile']['name'])) {print "O arquivo é valido e foi carregado com sucesso.

source: Here' s some more debugging info:\n"; print_r($_FILES);} else {print "Possible file upload attack!
pt_br: Aqui esta alguma informação:\n"; print_r($_FILES);} else {print "Possivel ataque de upload!

# Here' s some debugging info: "; print_r($_FILES);}?
source: Here' s some debugging info:\n"; print_r($_FILES);}?
pt_br: Aqui esta alguma informação:\n"; print_r($_FILES);}?

source: The PHP script which receives the uploaded file should implement whatever logic is necessary for determining what should be done with the uploaded file.
pt_br: O script PHP que irá receber o arquivo do upload deve implementar qualquer lógica que for necessária para determinar o que deve ser feito com o arquivo do upload.

source: You can for example use the $_FILES[ 'userfile']['size'] variable to throw away any files that are either too small or too big.
pt_br: Você pode, por exemplo, usar a variável $_FILES[ 'userfile']['size'] para descartar qualquer arquivo que seja muito pequeno ou muito grande.

source: You could use the $_FILES[ 'userfile']['type'] You could use the $_FILES['userfile']['type'] variable to throw away any files that didn't match a certain type criteria.
pt_br: Você pode usar a variável $_FILES[ 'userfile']['type'] que não sejam de um certo tipo.

source: As of PHP 4.2.0, you could use $_FILES[ 'userfile']['error'] and plan your logic according to the error codes.
pt_br: Desde o PHP 4.2.0, você pode usar $_FILES[ 'userfile']['error'] e planejar a sua lógica de acordo com os códigos de erro.

source: Whatever the logic, you should either delete the file from the temporary directory or move it elsewhere.
pt_br: Qualquer que seja a lógica, você deve excluir o arquivo do diretório temporário ou move-lo para outro lugar.

source: The file will be deleted from the temporary directory at the end of the request if it has not been moved away or renamed.
pt_br: O arquivo será excluído do diretório temporário ao fim do script se não tiver sido movido ou renomeado.

source: Multiple files can be uploaded using different name for input.
pt_br: Múltiplos arquivos podem ser carregados usando-se diferentes name para input.

source: It is also possible to upload multiple files simultaneously and have the information organized automatically in arrays for you.
pt_br: Também é possível carregar vários arquivos simultaneamente e ter a informação organizada automaticamente para você em arrays.

source: To do so, you need to use the same array submission syntax in the HTML form as you do with multiple selects and checkboxes:
pt_br: Para fazer assim, você precisa usar a mesma sintaxe no formulário HTML que você usa para múltiplos selects e checkboxes:

source: Support for multiple file uploads was added in version 3.0.10.
pt_br: O Suporte para carregar múltiplos arquivos foi adicionado na versão 3.0.10.

source: Example 18-3.
pt_br: Exemplo 18-3.

source: When the above form is submitted, the arrays $_FILES[ 'userfile'], $_FILES['userfile']['name'], and $_FILES['userfile']['size'] will be initialized (as well as in $HTTP_POST_FILES for PHP version prior 4.1.0).
pt_br: Quando o formulário acima é submetido, as matrizes $_FILES[ 'userfile'], $_FILES['userfile']['name'], e $_FILES['userfile']['size'] serão inicializadas (assim como $HTTP_POST_FILES para versões do PHP anterior a 4.1.0).

source: When register_globals is on, globals for uploaded files are also initialized.
pt_br: Quando register_globals esta em on, globals para os arquivos carregados também são inicializadas.

source: Each of these will be a numerically indexed array of the appropriate values for the submitted files.
pt_br: Cada um destes será uma array indexada numericamente dos valores apropriados para os arquivos submetidos.

source: For instance, assume that the filenames / home / test / review.html and / home / test / xwp.out are submitted.
pt_br: Por exemplo, assuma que os nomes de arquivos tenham sido submetidos / home / test / review.html e / home / test / xwp.out.

source: In this case, $_FILES[ 'userfile']['name'][0] would contain the value review.html, and $_FILES['userfile']['name'][1] would contain the value xwp.out.
pt_br: Neste caso, $_FILES[ 'userfile']['name'][0] deve conter o valor review.html, e $_FILES['userfile']['name'][1] deve conter o valor xwp.out.

source: Similarly, $_FILES[ 'userfile']['size'][0] would contain review.html's filesize, and so forth.
pt_br: Similarmente, $_FILES[ 'userfile']['size'][0] deve conter o tamanho de review.html, e assim por diante.
